# Pandas Practice

This notebook is dedicated to practicing different tasks with pandas. The solutions are available in a solutions notebook, however, you should always try to figure them out yourself first.

It should be noted there may be more than one different way to answer a question or complete an exercise.

Exercises are based off (and directly taken from) the quick introduction to pandas notebook.

Different tasks will be detailed by comments or text.

For further reference and resources, it's advised to check out the [pandas documentation](https://pandas.pydata.org/pandas-docs/stable/).

In [1]:
# Import pandas
import pandas as pd
import numpy as np

In [2]:
f1=pd.read_csv("./files/car-sales.csv")

In [3]:
# Create a series of three different colours
s1=pd.Series(['Gray','Black','Blue'])

In [4]:
# View the series of different colours
s1

0     Gray
1    Black
2     Blue
dtype: object

In [7]:
# Create a series of three different car types and view it
s2=pd.Series(['Porshe','BMW','Mercedes'])
s2

0      Porshe
1         BMW
2    Mercedes
dtype: object

In [8]:
# Combine the Series of cars and colours into a DataFrame
d1=pd.DataFrame({"colours":s1,"cars":s2})
d1

  colours      cars
0    Gray    Porshe
1   Black       BMW
2    Blue  Mercedes

In [9]:
# Import "../data/car-sales.csv" and turn it into a DataFrame
f1=pd.read_csv("./files/car-sales.csv")
df1=pd.DataFrame(f1)
df1

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

**Note:** Since you've imported `../data/car-sales.csv` as a DataFrame, we'll now refer to this DataFrame as 'the car sales DataFrame'.

In [7]:
# Export the DataFrame you created to a .csv file

In [10]:
# Find the different datatypes of the car data DataFrame
df1.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [11]:
# Describe your current car sales DataFrame using describe()
df1.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [12]:
# Get information about your DataFrame using info()
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

What does it show you?

In [13]:
# Create a Series of different numbers and find the mean of them
series1=pd.Series([1,2,3,4,5])
ans=series1.mean()
ans

3.0

In [14]:
# Create a Series of different numbers and find the sum of them
series1=pd.Series([1,2,3,4,5])
ans=series1.sum()
ans

15

In [18]:
# List out all the column names of the car sales DataFrame
df1['Make']
#df1['Make'].unique() for unique values

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [24]:
# Find the length of the car sales DataFrame
#df1.shape  it gives rows and columns
len(df1)

10

In [25]:
# Show the first 5 rows of the car sales DataFrame
df1.head(5)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [26]:
# Show the first 7 rows of the car sales DataFrame
df1.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [27]:
# Show the bottom 5 rows of the car sales DataFrame
df1.tail(5)

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [29]:
# Use .loc to select the row at index 3 of the car sales DataFrame
df1.loc[3,:]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [30]:
# Use .iloc to select the row at position 3 of the car sales DataFrame
df1.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

Notice how they're the same? Why do you think this is? 

Check the pandas documentation for [.loc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) and [.iloc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html). Think about a different situation each could be used for and try them out.

In [31]:
# Select the "Odometer (KM)" column from the car sales DataFrame
df1['Odometer (KM)']

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [32]:
# Find the mean of the "Odometer (KM)" column in the car sales DataFrame
df1['Odometer (KM)'].mean()

78601.4

In [33]:
# Select the rows with over 100,000 kilometers on the Odometer
x=df1[df1['Odometer (KM)'] > 100000]
x

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [38]:
# Create a crosstab of the Make and Doors columns
m1=df1['Make']
m2=df1['Doors']
pd.crosstab(m1,m2)

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [42]:
# Group columns of the car sales DataFrame by the Make column and find the average
#df1.groupby(by="Make")
#df1
df1.groupby(["Make"])
df1

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [25]:
# Import Matplotlib and create a plot of the Odometer column
# Don't forget to use %matplotlib inline

In [26]:
# Create a histogram of the Odometer column using hist()

In [27]:
# Try to plot the Price column using plot()

Why didn't it work? Can you think of a solution?

You might want to search for "how to convert a pandas string column to numbers".

And if you're still stuck, check out this [Stack Overflow question and answer on turning a price column into integers](https://stackoverflow.com/questions/44469313/price-column-object-to-int-in-pandas).

See how you can provide the example code there to the problem here.

In [57]:
# Remove the punctuation from price column
# use str.replace("[\$\,\.]", "")
# refer the link to study Punctuation replcemenet https://blog.enterprisedna.co/python-remove-punctuation-from-string

df1['Price']=df1['Price'].str.replace(r'[\$\,\.]', " ",regex=True)

0      4 000 00
1      5 000 00
2      7 000 00
3     22 000 00
4      3 500 00
5      4 500 00
6      7 500 00
7      7 000 00
8      6 250 00
9      9 700 00
Name: Price, dtype: object

In [58]:
# Check the changes to the price column
df1['Price']

0      4 000 00
1      5 000 00
2      7 000 00
3     22 000 00
4      3 500 00
5      4 500 00
6      7 500 00
7      7 000 00
8      6 250 00
9      9 700 00
Name: Price, dtype: object

In [66]:
# Remove the two extra zeros at the end of the price column
df1['Price']=df1['Price'].str.rstrip('0')

In [67]:
# Check the changes to the Price column
df1['Price']

0      4 000
1      5 000
2      7 000
3     22 000
4      3 500
5      4 500
6      7 500
7      7 000
8      6 250
9      9 700
Name: Price, dtype: object

In [78]:
# Change the datatype of the Price column to integers
df1['Price'].dtypes

dtype('O')

In [83]:
# Lower the strings of the Make column
df1['Make']=df1['Make'].lower()

AttributeError: 'Series' object has no attribute 'lower'

If you check the car sales DataFrame, you'll notice the Make column hasn't been lowered.

How could you make these changes permanent?

Try it out.

In [88]:
# Make lowering the case of the Make column permanent
df1.dtypes

Make             float64
Colour            object
Odometer (KM)      int64
Doors              int64
Price             object
dtype: object

In [84]:
# Check the car sales DataFrame
df1.describe()

       Make  Odometer (KM)      Doors
count   0.0      10.000000  10.000000
mean    NaN   78601.400000   4.000000
std     NaN   61983.471735   0.471405
min     NaN   11179.000000   3.000000
25%     NaN   35836.250000   4.000000
50%     NaN   57369.000000   4.000000
75%     NaN   96384.500000   4.000000
max     NaN  213095.000000   5.000000

## Extensions

For more exercises, check out the pandas documentation, particularly the [10-minutes to pandas section](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html). 

One great exercise would be to retype out the entire section into a Jupyter Notebook of your own.

Get hands-on with the code and see what it does.

The next place you should check out are the [top questions and answers on Stack Overflow for pandas](https://stackoverflow.com/questions/tagged/pandas?sort=MostVotes&edited=true). Often, these contain some of the most useful and common pandas functions. Be sure to play around with the different filters!

Finally, always remember, the best way to learn something new to is try it. Make mistakes. Ask questions, get things wrong, take note of the things you do most often. And don't worry if you keep making the same mistake, pandas has many ways to do the same thing and is a big library. So it'll likely take a while before you get the hang of it.